/* 
---------------------------------------------------------------------------------------------------
Урок 1. Знакомство с языком программирования С#
Ветки:
git checkout task1 - Задача 2: Напишите программу, которая на вход принимает два числа 
и выдаёт, какое число большее, а какое меньшее.

git checkout task2 - Задача 4: Напишите программу, которая принимает на вход три числа 
и выдаёт максимальное из этих чисел.

git checkout task3 - Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка).

git checkout task4 - Задача 8: Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.
---------------------------------------------------------------------------------------------------
Урок 2. Базовые алгоритмы
git checkout task5 - Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
и на выходе показывает вторую цифру этого числа.

git checkout task6 - Задача 13: Напишите программу, которая выводит третью цифру 
заданного числа или сообщает, что третьей цифры нет.

git checkout task7 - Задача 15: Напишите программу, которая принимает на вход цифру, 
обозначающую день недели, и проверяет, является ли этот день выходным.
---------------------------------------------------------------------------------------------------
Урок 3. Базовые алгоритмы. Продолжение
git checkout task8 - Задача 19. Напишите программу, которая принимает на вход пятизначное число 
и проверяет, является ли оно палиндромом.

git checkout task9 - Задача 21. Напишите программу, которая принимает на вход координаты двух точек 
и находит расстояние между ними в 3D пространстве.

git checkout task10 - Задача 23. Напишите программу, которая принимает на вход число (N) 
и выдаёт таблицу кубов чисел от 1 до 
---------------------------------------------------------------------------------------------------
Урок 4. Функции
git checkout task11 - Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и 
возводит число A в натуральную степень B.

git checkout task12 - Задача 27: Напишите программу, которая принимает на вход число и 
выдаёт сумму цифр в числе.

git checkout task13 - Задача 29: Напишите программу, которая задаёт массив из 8 элементов и 
выводит их на экран.
*/

