/*Урок 1. Знакомство с языком программирования С#

Ветки:
git checkout task1 - Задача 2: Напишите программу, которая на вход принимает два числа 
и выдаёт, какое число большее, а какое меньшее.

git checkout task2 - Задача 4: Напишите программу, которая принимает на вход три числа 
и выдаёт максимальное из этих чисел.

git checkout task3 - Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка).

git checkout task4 - Задача 8: Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.
*/

