/* 
-------------------------------------------------------------------------------------------------
Урок 1. Знакомство с языком программирования С#
Ветки:
git checkout task1 - Задача 2: Напишите программу, которая на вход принимает два числа 
и выдаёт, какое число большее, а какое меньшее.

git checkout task2 - Задача 4: Напишите программу, которая принимает на вход три числа 
и выдаёт максимальное из этих чисел.

git checkout task3 - Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка).

git checkout task4 - Задача 8: Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.
-------------------------------------------------------------------------------------------------
Урок 2. Базовые алгоритмы
git checkout task5 - Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
и на выходе показывает вторую цифру этого числа.

git checkout task6 - Задача 13: Напишите программу, которая выводит третью цифру 
заданного числа или сообщает, что третьей цифры нет.

git checkout task7 - Задача 15: Напишите программу, которая принимает на вход цифру, 
обозначающую день недели, и проверяет, является ли этот день выходным.
-------------------------------------------------------------------------------------------------
*/

