/* 
---------------------------------------------------------------------------------------------------
Урок 1. Знакомство с языком программирования С#
Ветки:
git checkout task1 - Задача 2: Напишите программу, которая на вход принимает два числа 
и выдаёт, какое число большее, а какое меньшее.

git checkout task2 - Задача 4: Напишите программу, которая принимает на вход три числа 
и выдаёт максимальное из этих чисел.

git checkout task3 - Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
является ли число чётным (делится ли оно на два без остатка).

git checkout task4 - Задача 8: Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.
---------------------------------------------------------------------------------------------------
Урок 2. Базовые алгоритмы
git checkout task5 - Задача 10: Напишите программу, которая принимает на вход 
трёхзначное число и на выходе показывает вторую цифру этого числа.

git checkout task6 - Задача 13: Напишите программу, которая выводит третью цифру 
заданного числа или сообщает, что третьей цифры нет.

git checkout task7 - Задача 15: Напишите программу, которая принимает на вход цифру, 
обозначающую день недели, и проверяет, является ли этот день выходным.
---------------------------------------------------------------------------------------------------
Урок 3. Базовые алгоритмы. Продолжение
git checkout task8 - Задача 19. Напишите программу, которая принимает на вход 
пятизначное число и проверяет, является ли оно палиндромом.

git checkout task9 - Задача 21. Напишите программу, которая принимает на вход координаты
двух точек и находит расстояние между ними в 3D пространстве.

git checkout task10 - Задача 23. Напишите программу, которая принимает на вход число (N) 
и выдаёт таблицу кубов чисел от 1 до 
---------------------------------------------------------------------------------------------------
Урок 4. Функции
git checkout task11 - Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и 
возводит число A в натуральную степень B.

git checkout task12 - Задача 27: Напишите программу, которая принимает на вход число и 
выдаёт сумму цифр в числе.

git checkout task13 - Задача 29: Напишите программу, которая задаёт массив из 8 элементов и 
выводит их на экран.
---------------------------------------------------------------------------------------------------
Урок 5. Функции и одномерные массивы

git checkout task14 - Задача 34: Задайте массив заполненный случайными положительными 
трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.

git checkout task15 - Задача 36: Задайте одномерный массив, заполненный случайными числами. 
Найдите сумму элементов, стоящих на нечётных позициях.

git checkout task16 - Задача 38: Задайте массив вещественных чисел. Найдите разницу между 
максимальным и минимальным элементов массива.
---------------------------------------------------------------------------------------------------
Урок 6. Одномерные массивы. Продолжение

git checkout task17 – Задача 41: Пользователь вводит с клавиатуры M чисел. 
Посчитайте, сколько чисел больше 0 ввёл пользователь.

git checkout task18 – Задача 43: Напишите программу, которая найдёт точку пересечения 
двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
значения b1, k1, b2 и k2 задаются пользователем.

---------------------------------------------------------------------------------------------------

Урок 7. Двумерные массивы

git checkout task19 – Задача 47. Задайте двумерный массив размером m×n, 
заполненный случайными вещественными числами.

git checkout task20 – Задача 50. Напишите программу, которая на вход принимает позиции элемента 
в двумерном массиве, и возвращает значение этого элемента или же указание, что такого элемента нет.

git checkout task21 – Задача 52. Задайте двумерный массив из целых чисел. 
Найдите среднее арифметическое элементов в каждом столбце.

---------------------------------------------------------------------------------------------------

Урок 8. Двумерные массивы. Продолжение

git checkout task22 – Задача 54: Задайте двумерный массив. Напишите программу, 
которая упорядочит по убыванию элементы каждой строки двумерного массива.

git checkout task23 – Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, 
которая будет находить строку с наименьшей суммой элементов.

git checkout task24 – Задача 58: Задайте две матрицы. 
Напишите программу, которая будет находить произведение двух матриц.

git checkout task25 – Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся
двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы 
каждого элемента.

git checkout task26 – Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.

git checkout task27 – Доп. задача. Найти еще варианты решения без сортировки 
Задача 57: Составить частотный словарь элементов двумерного массива. 
Частотный словарь содержит информацию о том, сколько раз встречается элемент входных данных.
1, 2, 3
4, 6, 1
2, 1, 6
1 встречается 3 раза
2 встречается 2 раз
3 встречается 1 раз
4 встречается 1 раз
6 встречается 2 раза

*/

